{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "decoder": {
    "_name_or_path": "distilroberta-base",
    "add_cross_attention": true,
    "architectures": [
      "RobertaForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bad_words_ids": null,
    "bos_token_id": 0,
    "chunk_size_feed_forward": 0,
    "decoder_start_token_id": null,
    "do_sample": false,
    "early_stopping": false,
    "eos_token_id": 2,
    "finetuning_task": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": true,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "max_position_embeddings": 514,
    "min_length": 0,
    "model_type": "roberta",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 12,
    "num_beams": 1,
    "num_hidden_layers": 6,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "pad_token_id": 1,
    "prefix": null,
    "pruned_heads": {},
    "repetition_penalty": 1.0,
    "return_dict": false,
    "sep_token_id": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torchscript": false,
    "type_vocab_size": 1,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 50265,
    "xla_device": null
  },
  "encoder": {
    "_name_or_path": "distilroberta-base",
    "add_cross_attention": false,
    "architectures": [
      "RobertaForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "bad_words_ids": null,
    "bos_token_id": 0,
    "chunk_size_feed_forward": 0,
    "decoder_start_token_id": null,
    "do_sample": false,
    "early_stopping": false,
    "eos_token_id": 2,
    "finetuning_task": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "max_position_embeddings": 514,
    "min_length": 0,
    "model_type": "roberta",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 12,
    "num_beams": 1,
    "num_hidden_layers": 6,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "pad_token_id": 1,
    "prefix": null,
    "pruned_heads": {},
    "repetition_penalty": 1.0,
    "return_dict": false,
    "sep_token_id": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torchscript": false,
    "type_vocab_size": 1,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 50265,
    "xla_device": null
  },
  "is_encoder_decoder": true,
  "model_type": "encoder_decoder",
  "tie_encoder_decoder": true
}
